# from warcio.archiveiterator import ArchiveIterator

# with open('path/to/file', 'rb') as stream:
#     for record in ArchiveIterator(stream):
#         if record.rec_type == 'response':
#             print(record.rec_headers.get_header('WARC-Target-URI'))


from warcio.archiveiterator import ArchiveIterator
with open('../CC-MAIN-20190715175205-20190715201205-00291.warc.wet', 'rb') as stream:
    for i, record in enumerate(ArchiveIterator(stream)):
#         if record.rec_type == 'response':
        if i < 2:
            print('rec_num', i)
            print('rec_type', record.rec_type)
            print(record.rec_headers.get_header('WARC-Target-URI'))
            print(type(record.rec_headers))
            print('record format:', record.format)

            print('content_stream().read():', bytes.decode(record.content_stream().read()))
            # print('raw stream read', bytes.decode(record.raw_stream.read()))

        else:
            break


x = [('アクセスマップはコチラ', 4, 'http://0120561092.com'),
('tel', 4, 'http://0120561092.com'),
('営業', 4, 'http://0120561092.com'),
('10時', 4, 'http://0120561092.com'),
('19時', 4, 'http://0120561092.com'),
('japan', 3, 'http://0120561092.com'),
('ジュエリー', 3, 'http://0120561092.com'),
('火曜定休', 3, 'http://0120561092.com'),
('gold', 2, 'http://0120561092.com'),
('松山本店', 2, 'http://0120561092.com'),
('今治店', 2, 'http://0120561092.com'),
('新居浜店', 2, 'http://0120561092.com'),
('宮崎店', 2, 'http://0120561092.com'),
('メール会員登録', 2, 'http://0120561092.com'),
('よくあるご質問', 2, 'http://0120561092.com'),
('お客様の声', 2, 'http://0120561092.com'),
('ブランド品', 2, 'http://0120561092.com'),
('グッチ', 2, 'http://0120561092.com'),
('エルメス', 2, 'http://0120561092.com'),
('ヴィトン', 2, 'http://0120561092.com'),
('お問い合わせ', 2, 'http://0120561092.com'),
('個人情報保護方針', 2, 'http://0120561092.com'),
('運営会社', 2, 'http://0120561092.com'),
('商品の詳細', 1, 'http://0120561092.com'),
('愛媛で金', 1, 'http://0120561092.com'),
('時計', 1, 'http://0120561092.com'),
('ブランド売るなら買取り専門店ゴールドジャパン', 1, 'http://0120561092.com'),
('javascript', 1, 'http://0120561092.com'),
('を有効にしてご利用下さい', 1, 'http://0120561092.com'),
('金やダイヤ', 1, 'http://0120561092.com'),
('ブランド品の高価買取は愛媛のgold', 1, 'http://0120561092.com'),
('ゴールドジャパン', 1, 'http://0120561092.com'),
('topページへ', 1, 'http://0120561092.com'),
('法人様専用窓口', 1, 'http://0120561092.com'),
('店頭買取はこちら', 1, 'http://0120561092.com'),
('郵送買取はこちら', 1, 'http://0120561092.com'),
('出張買取はこちら', 1, 'http://0120561092.com'),
('01月15日', 1, 'http://0120561092.com'),
('k24インゴット', 1, 'http://0120561092.com'),
('pt1000インゴット', 1, 'http://0120561092.com'),
('ゴールドジャパンブログ', 1, 'http://0120561092.com'),
('ゴールドジャパンスタッフブログ', 1, 'http://0120561092.com'),
('店長ブログ', 1, 'http://0120561092.com'),
('松山市で金のweb査定申込', 1, 'http://0120561092.com'),
('松山市で金のfax査定申込', 1, 'http://0120561092.com'),
('ブランド一覧', 1, 'http://0120561092.com'),
('初めてのお客様', 1, 'http://0120561092.com'),
('金に関する知識', 1, 'http://0120561092.com'),
('腕時計のお手入れについて', 1, 'http://0120561092.com'),
('ダイヤモンド買取の予備知識', 1, 'http://0120561092.com'),
('ブランドバッグのお手入れ方法', 1, 'http://0120561092.com'),
('金かメッキかを見分ける方法', 1, 'http://0120561092.com'),
('時計を高額査定してもらうためのポイント', 1, 'http://0120561092.com'),
('ブランド腕時計が持つメリット', 1, 'http://0120561092.com'),
('貴金属', 1, 'http://0120561092.com'),
('宝石買取りの予備知識', 1, 'http://0120561092.com'),
('偽物ブランド品を見分ける方法とは', 1, 'http://0120561092.com'),
('壊れていても買取りできる貴金属', 1, 'http://0120561092.com'),
('時計について', 1, 'http://0120561092.com'),
('時計買取りの予備知識', 1, 'http://0120561092.com'),
('ロレックス買取り', 1, 'http://0120561092.com'),
('デイトジャスト', 1, 'http://0120561092.com'),
('デイトナ', 1, 'http://0120561092.com'),
('デイデイト', 1, 'http://0120561092.com'),
('サブマリーナ', 1, 'http://0120561092.com'),
('ジャンクのデイトジャストも買取りok', 1, 'http://0120561092.com'),
('金', 1, 'http://0120561092.com'),
('プラチナの刻印の意味', 1, 'http://0120561092.com'),
('ダイヤなどの宝石からk18まで高価買取り中', 1, 'http://0120561092.com'),
('シャネルなどを個人売却するリスク', 1, 'http://0120561092.com'),
('ロレックスやシャネルなどのハイブランドはコピーに注意', 1, 'http://0120561092.com'),
('プラチナは金に負けない貴金属', 1, 'http://0120561092.com'),
('ファンシーカラーについて', 1, 'http://0120561092.com'),
('カルティエの魅力', 1, 'http://0120561092.com'),
('シャネルの魅力', 1, 'http://0120561092.com'),
('過去の買取商品の一例', 1, 'http://0120561092.com'),
('コピー品撲滅', 1, 'http://0120561092.com'),
('ご注意ください', 1, 'http://0120561092.com'),
('ブランド販売はtenko楽天市場店へ', 1, 'http://0120561092.com'),
('ブランド販売のtenkoヤフー店へ', 1, 'http://0120561092.com'),
('ブランド販売のtenkoヤフーオークション店へ', 1, 'http://0120561092.com'),
('貴金属買取.biz', 1, 'http://0120561092.com'),
('フルラのミニパイパーを買取りました', 1, 'http://0120561092.com'),
('松山市山越3', 1, 'http://0120561092.com'),
('マリンビル1f', 1, 'http://0120561092.com'),
('年中無休', 1, 'http://0120561092.com'),
('今治市中寺256', 1, 'http://0120561092.com'),
('新居浜市西の土居町1', 1, 'http://0120561092.com')]


